# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, 
# и возводит число А в целую степень B с помощью рекурсии.

# def degree(a, b, c):
#     if b == 0:
#         return c
#     return degree(a, b - 1, c * a)

# a = int(input("Введите число возводимое в степень: "))
# b = int(input("Степень числа: "))
# c = a
# print(f"Ваше число {a} в степени {b} равно {degree(a, b, c)}")



